## Pandas digunakan untuk dua data berbeda
### 1. Series merepresentasikan data dalam bentuk 1D
### 2. Data Frame merepresentasikan data dalam bentuk tabular 2D

In [1]:
#pandas series adalah 1D array dengan label

In [5]:
import pandas as pd

In [7]:
#pandas series berasal dari Python dictionaries (struktur data untuk menyimpan sepasang key value)
#keys memuat index atau label untuk value
dict={'a':3, 'b':'cat', 'c':2.5} #a adalah label dan 3 adalah index atau value
pd.Series(dict) #S untuk series harus kapital

a      3
b    cat
c    2.5
dtype: object

In [11]:
oneD=pd.Series([100, 'cat', 310, 'gog', 500], ['Amy', 'Bobby', 'Cat', 'Don', 'Emma'])
oneD

Amy      100
Bobby    cat
Cat      310
Don      gog
Emma     500
dtype: object

In [12]:
oneD=pd.Series([100, 'cat', 310, 'gog', 500], index=['Amy', 'Bobby', 'Cat', 'Don', 'Emma']) #index untuk label values
oneD

Amy      100
Bobby    cat
Cat      310
Don      gog
Emma     500
dtype: object

In [13]:
oneD.loc[['Cat','Emma']] #loc adalah lokasi label berdasarkan index yang dipilih dengan label yaitu cat dan emma

Cat     310
Emma    500
dtype: object

In [15]:
oneD[[0,3,4]] #menampilkan data pada index 0, 3 dan 4

Amy     100
Don     gog
Emma    500
dtype: object

In [14]:
oneD.iloc[1] #iloc menampilkan berdasarkan posisi integer di perintah dalam contoh mengakses index 1 (dari 0 hingga panjangnya -1 berdasarkan axis)

'cat'

In [16]:
'cat' in oneD #mengecek apakah cat terdapat dalam index series

False

In [17]:
'Cat' in oneD #yang digunakan adalah labelnya

True

In [18]:
d={'A':pd.Series([100.,200.,300.], index=['apple', 'orange', 'pear']),
   'B':pd.Series([111.,222.,333.,444.], index=['apple', 'orange', 'pear', 'melon'])}

In [19]:
df=pd.DataFrame(d)
print(df) #ketika tidak ada nilai maka indeks akan menghasilkan Nan

            A      B
apple   100.0  111.0
melon     NaN  444.0
orange  200.0  222.0
pear    300.0  333.0

In [20]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [21]:
df.index #menampilkan indeks

Index(['apple', 'melon', 'orange', 'pear'], dtype='object')

In [22]:
df.columns #menampilkan kolom

Index(['A', 'B'], dtype='object')

In [23]:
pd.DataFrame(df, index=['orange', 'melon', 'apple'], columns=['A']) #menampilkan baris/indeks dan kolom yang diinginkan

            A
orange  200.0
melon     NaN
apple   100.0

## read in csv

In [1]:
import numpy as np
import pandas as pd

In [3]:
file="D:\Data Science\scriptsLecture\section4\Resp2.csv"
df1=pd.read_csv(file)
df1.head() #df head menampilkan banyaknya tabel yang akan ditampilkan

#membuka file csv harus menggunakan underskor pada fungsinya

   experience  respiration
0           0         3.94
1           0         4.26
2           0         4.16
3           0         3.76
4           0         4.07

In [8]:
#membuka file csv dengan separator atau pemisah
file="D:\Data Science\scriptsLecture\section4\winequality-red.csv"
df1=pd.read_csv(file)
df1=pd.read_csv(file, sep=";") #fungsi pemisah untuk tabel yang tidak beraturan
df1.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

## read in .txt

In [ ]:
import numpy as np
import pandas as pd

In [30]:
file="D:\\Data Science\\scriptsLecture\\section4\\bostonTxt.txt" #membukanya dengan garis miring dua
df1=pd.read_csv(file)
df1=pd.read_csv(file, sep="\t") #t adalah tab
df1.head()

     MV  INDUS   NOX     RM  TAX    PT  LSTAT
0  24.0   2.31  53.8  6.575  296  15.3   4.98
1  21.6   7.07  46.9  6.421  242  17.8   9.14
2  34.7   7.07  46.9  7.185  242  17.8   4.03
3  33.4   2.18  45.8  6.998  222  18.7   2.94
4  36.2   2.18  45.8  7.147  222  18.7   5.33

## read file excel

In [22]:
import pandas as pd

In [23]:
import os

In [24]:
os.getcwd()

'D:\\'

In [28]:
file="D:\\Data Science\\scriptsLecture\\section4\\boston1.xls"
x1=pd.ExcelFile(file) #membuka file excel
print(x1.sheet_names) #melihat nama sheet

['Sheet1', 'Sheet2']

In [32]:
df1=x1.parse("Sheet1") #df adalah dataframe
df1.head()

,MV,INDUS,NOX,RM,TAX,PT,LSTAT,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,24.0,2.31,53.8,6.575,296,15.3,4.98,NaN,NaN,Subset of Boston housing tract
1,21.6,7.07,46.9,6.421,242,17.8,9.14,NaN,NaN,data of Harrison and Rubinfeld
2,34.7,7.07,46.9,7.185,242,17.8,4.03,NaN,NaN,(1978). Each case is one U.S.
3,33.4,2.18,45.8,6.998,222,18.7,2.94,NaN,NaN,Census tract in the Boston area.
4,36.2,2.18,45.8,7.147,222,18.7,5.33,NaN,NaN,NaN

## read json file

In [33]:
import pandas as pd
import json
#examine file json online : https://codebeautify.org/jsonviewer

In [37]:
file="D:\\Data Science\\scriptsLecture\\section4\\skorea.json"
df=pd.read_json(file)
df.head(6)

,Area ha (acre),Criteria,Description,Image,Location,Site,Year
0,135 (330),Cultural: (ii)(iii),,/wiki/File:MuryeongsTomb.jpg,"South Chungcheong, North Jeolla",Baekje Historic Areas,2015
1,,Cultural: (iii),,/wiki/File:Korea-Gwangju-Gochang_Dolmens_5350-...,"Incheon, North Jeolla, South Jeolla","Gochang, Hwasun and Ganghwa Dolmen Sites",2000
2,,Cultural: (ii)(iii)(iv),,"/wiki/File:Juhamnu,_Changdeokgung_-_Seoul,_Kor...",Seoul,Changdeokgung Palace Complex,1997
3,"2,880 (7,100)",Cultural: (ii)(iii),,/wiki/File:Korea-Gyeongju-Bunhwangsa-Lanterns-...,North Gyeongsang,Gyeongju Historic Areas,2000
4,,Cultural: (iv)(vi),,/wiki/File:Haeinsa_Temple_(6222053899).jpg,South Gyeongsang,"Haeinsa Temple Janggyeong Panjeon, the Deposit...",1995
5,"600 (1,500)",Cultural: (iii)(iv),,/wiki/File:Hahoe_8784.jpg,North Gyeongsang,Historic Villages of Korea: Hahoe and Yangdong,2010

In [38]:
df.shape #mengecek jumlah baris dan kolom

(12, 7)

In [39]:
#web=pd.read_json("urlgithubnya")
#web.head(4)

## read html file

In [40]:
import pandas as pd
import html5lib

In [41]:
uss=pd.read_html("https://simple.wikipedia.org/wiki/List_of_U.S._states") #mengambil data dari web

In [42]:
print(type(uss)) #melihat tipe data

<class 'list'>

In [43]:
u=uss[0] # menampilkan data frame dari index 0
print(u)

                          Name & Abbr          Cities                  \
                          Name & Abbr         Capital      Largest[3]
0                        Alabama   AL      Montgomery      Birmingham
1                         Alaska   AK          Juneau       Anchorage
2                        Arizona   AZ         Phoenix         Phoenix
3                       Arkansas   AR     Little Rock     Little Rock
4                     California   CA      Sacramento     Los Angeles
5                       Colorado   CO          Denver          Denver
6                    Connecticut   CT        Hartford      Bridgeport
7                       Delaware   DE           Dover      Wilmington
8                        Florida   FL     Tallahassee    Jacksonville
9                        Georgia   GA         Atlanta         Atlanta
10                        Hawaii   HI        Honolulu        Honolulu
11                         Idaho   ID           Boise           Boise
12                      Illinois   IL     Springfield         Chicago
13                       Indiana   IN    Indianapolis    Indianapolis
14                          Iowa   IA      Des Moines      Des Moines
15                        Kansas   KS          Topeka         Wichita
16       Kentucky[upper-alpha 2]   KY       Frankfort      Louisville
17                     Louisiana   LA     Baton Rouge     New Orleans
18                         Maine   ME         Augusta        Portland
19                      Maryland   MD       Annapolis       Baltimore
20  Massachusetts[upper-alpha 2]   MA          Boston          Boston
21                      Michigan   MI         Lansing         Detroit
22                     Minnesota   MN        St. Paul     Minneapolis
23                   Mississippi   MS         Jackson         Jackson
24                      Missouri   MO  Jefferson City     Kansas City
25                       Montana   MT          Helena        Billings
26                      Nebraska   NE         Lincoln           Omaha
27                        Nevada   NV     Carson City       Las Vegas
28                 New Hampshire   NH         Concord      Manchester
29                    New Jersey   NJ         Trenton          Newark
30                    New Mexico   NM        Santa Fe     Albuquerque
31                      New York   NY          Albany        New York
32                North Carolina   NC         Raleigh       Charlotte
33                  North Dakota   ND        Bismarck           Fargo
34                          Ohio   OH        Columbus        Columbus
35                      Oklahoma   OK   Oklahoma City   Oklahoma City
36                        Oregon   OR           Salem        Portland
37   Pennsylvania[upper-alpha 2]   PA      Harrisburg    Philadelphia
38   Rhode Island[upper-alpha 3]   RI      Providence      Providence
39                South Carolina   SC        Columbia      Charleston
40                  South Dakota   SD          Pierre     Sioux Falls
41                     Tennessee   TN       Nashville       Nashville
42                         Texas   TX          Austin         Houston
43                          Utah   UT  Salt Lake City  Salt Lake City
44                       Vermont   VT      Montpelier      Burlington
45       Virginia[upper-alpha 2]   VA        Richmond  Virginia Beach
46                    Washington   WA         Olympia         Seattle
47                 West Virginia   WV      Charleston      Charleston
48                     Wisconsin   WI         Madison       Milwaukee
49                       Wyoming   WY        Cheyenne        Cheyenne

     Established Population[upper-alpha 1][1] Total area[2]           \
     Established Population[upper-alpha 1][1]           mi2      km2
0   Dec 14, 1819                      4874747         52420   135767
1    Jan 3, 1959                       739795        665384  1723337
2   Feb 14, 1912                      7016270        113990   295234
3   Jun 15, 1836                      3004279         53179   137732
4    Sep 9, 1850                     39536653        163695   423967
5    Aug 1, 1876                      5607154        104094   269601
6    Jan 9, 1788                      3588184          5543    14357
7    Dec 7, 1787                       961939          2489     6446
8    Mar 3, 1845                     20984400         65758   170312
9    Jan 2, 1788                     10429379         59425   153910
10  Aug 21, 1959                      1427538         10932    28313
11   Jul 3, 1890                      1716943         83569   216443
12   Dec 3, 1818                     12802023         57914   149995
13  Dec 11, 1816                      6666818         36420    94326
14  Dec 28, 1846                      3145711         56273   145746
15  Jan 29, 1861                      2913123         82278   213100
16   Jun 1, 1792                      4454189         40408   104656
17  Apr 30, 1812                      4684333         52378   135659
18  Mar 15, 1820                      1335907         35380    91633
19  Apr 28, 1788                      6052177         12406    32131
20   Feb 6, 1788                      6859819         10554    27336
21  Jan 26, 1837                      9962311         96714   250487
22  May 11, 1858                      5576606         86936   225163
23  Dec 10, 1817                      2984100         48432   125438
24  Aug 10, 1821                      6113532         69707   180540
25   Nov 8, 1889                      1050493        147040   380831
26   Mar 1, 1867                      1920076         77348   200330
27  Oct 31, 1864                      2998039        110572   286380
28  Jun 21, 1788                      1342795          9349    24214
29  Dec 18, 1787                      9005644          8723    22591
30   Jan 6, 1912                      2088070        121590   314917
31  Jul 26, 1788                     19849399         54555   141297
32  Nov 21, 1789                     10273419         53819   139391
33   Nov 2, 1889                       755393         70698   183108
34   Mar 1, 1803                     11658609         44826   116098
35  Nov 16, 1907                      3930864         69899   181037
36  Feb 14, 1859                      4142776         98379   254799
37  Dec 12, 1787                     12805537         46054   119280
38  May 29, 1790                      1059639          1545     4001
39  May 23, 1788                      5024369         32020    82933
40   Nov 2, 1889                       869666         77116   199729
41   Jun 1, 1796                      6715984         42144   109153
42  Dec 29, 1845                     28304596        268596   695662
43   Jan 4, 1896                      3101833         84897   219882
44   Mar 4, 1791                       623657          9616    24906
45  Jun 25, 1788                      8470020         42775   110787
46  Nov 11, 1889                      7405743         71298   184661
47  Jun 20, 1863                      1815857         24230    62756
48  May 29, 1848                      5795483         65496   169635
49  Jul 10, 1890                       579315         97813   253335

   Land area[2]          Water area[2]         Numberof Reps.
            mi2      km2           mi2     km2 Numberof Reps.
0         50645   131171          1775    4597              7
1        570641  1477953         94743  245384              1
2        113594   294207           396    1026              9
3         52035   134771          1143    2961              4
4        155779   403466          7916   20501             53
5        103642   268431           452    1170              7
6          4842    12542           701    1816              5
7          1949     5047           540    1399              1
8         53625   138887         12133   31424             27
9         57513   148959          1912    4951             14
10         6423    16635          4509   11678              2
11        82643   214045           926    2398              2
12        55519   143793          2395    6202             18
13        35826    92789           593    1537              9
14        55857   144669           416    1077              4
15        81759   211754           520    1346              4
16        39486   102269           921    2387              6
17        43204   111898          9174   23761              6
18        30843    79883          4537   11750              2
19         9707    25142          2699    6990              8
20         7800    20202          2754    7134              9
21        56539   146435         40175  104052             14
22        79627   206232          7309   18930              8
23        46923   121531          1508    3907              4
24        68742   178040           965    2501              8
25       145546   376962          1494    3869              1
26        76824   198974           524    1356              3
27       109781   284332           791    2048              4
28         8953    23187           397    1027              2
29         7354    19047          1368    3544             12
30       121298   314161           292     757              3
31        47126   122057          7429   19240             27
32        48618   125920          5201   13471             13
33        69001   178711          1698    4397              1
34        40861   105829          3965   10269             16
35        68595   177660          1304    3377              5
36        95988   248608          2391    6191              5
37        44743   115883          1312    3397             18
38         1034     2678           511    1324              2
39        30061    77857          1960    5076              7
40        75811   196350          1305    3379              1
41        41235   106798           909    2355              9
42       261232   676587          7365   19075             36
43        82170   212818          2727    7064              4
44         9217    23871           400    1035              1
45        39490   102279          3285    8508             11
46        66456   172119          4842   12542             10
47        24038    62259           192     497              3
48        54158   140268         11339   29367              8
49        97093   251470           720    1864              1

In [45]:
url="https://www.fdic.gov/bank/individual/failed/banklist.html"
dfs=pd.read_html(url)
print(type(dfs))

<class 'list'>

In [46]:
df=dfs[0]
print(df)

                                             Bank Name                City  \
0                  Washington Federal Bank for Savings             Chicago
1      The Farmers and Merchants State Bank of Argonia             Argonia
2                                  Fayette County Bank          Saint Elmo
3    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
4                                       First NBC Bank         New Orleans
5                                        Proficio Bank  Cottonwood Heights
6                        Seaway Bank and Trust Company             Chicago
7                               Harvest Community Bank          Pennsville
8                                          Allied Bank            Mulberry
9                         The Woodbury Banking Company            Woodbury
10                              First CornerStone Bank     King of Prussia
11                                  Trust Company Bank             Memphis
12                          North Milwaukee State Bank           Milwaukee
13                              Hometown National Bank            Longview
14                                 The Bank of Georgia      Peachtree City
15                                        Premier Bank              Denver
16                                      Edgebrook Bank             Chicago
17                              Doral Bank  En Espanol            San Juan
18                   Capitol City Bank & Trust Company             Atlanta
19                             Highland Community Bank             Chicago
20                    First National Bank of Crestview           Crestview
21                                  Northern Star Bank             Mankato
22              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
23               The National Republic Bank of Chicago             Chicago
24                                      NBRS Financial          Rising Sun
25                               GreenChoice Bank, fsb             Chicago
26                            Eastside Commercial Bank             Conyers
27                              The Freedom State Bank             Freedom
28                                         Valley Bank     Fort Lauderdale
29                                         Valley Bank              Moline
..                                                 ...                 ...
525                                  ANB Financial, NA         Bentonville
526                                          Hume Bank                Hume
527                             Douglass National Bank         Kansas City
528                                  Miami Valley Bank            Lakeview
529                                            NetBank          Alpharetta
530                          Metropolitan Savings Bank          Pittsburgh
531                                    Bank of Ephraim             Ephraim
532                                      Reliance Bank        White Plains
533              Guaranty National Bank of Tallahassee         Tallahassee
534                                Dollar Savings Bank              Newark
535                               Pulaski Savings Bank        Philadelphia
536              First National Bank of Blanchardville      Blanchardville
537                              Southern Pacific Bank            Torrance
538                        Farmers Bank of Cheneyville         Cheneyville
539                                      Bank of Alamo               Alamo
540             AmTrade International Bank  En Espanol             Atlanta
541                     Universal Federal Savings Bank             Chicago
542                       Connecticut Bank of Commerce            Stamford
543                                   New Century Bank     Shelby Township
544                              Net 1st National Bank          Boca Raton
545                                       NextBank, NA             Phoenix
546                           Oakwood Deposit Bank Co.             Oakwood
547                              Bank of Sierra Blanca       Sierra Blanca
548                      Hamilton Bank, NA  En Espanol               Miami
549                             Sinclair National Bank            Gravette
550                                 Superior Bank, FSB            Hinsdale
551                                Malta National Bank               Malta
552                    First Alliance Bank & Trust Co.          Manchester
553                  National State Bank of Metropolis          Metropolis
554                                   Bank of Honolulu            Honolulu

     ST   CERT                Acquiring Institution        Closing Date  \
0    IL  30570                   Royal Savings Bank   December 15, 2017
1    KS  17719                          Conway Bank    October 13, 2017
2    IL   1802            United Fidelity Bank, fsb        May 26, 2017
3    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
4    LA  58302                         Whitney Bank      April 28, 2017
5    UT  35495                    Cache Valley Bank       March 3, 2017
6    IL  19328                  State Bank of Texas    January 27, 2017
7    NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
8    AR     91                         Today's Bank  September 23, 2016
9    GA  11297                          United Bank     August 19, 2016
10   PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
11   TN   9956           The Bank of Fayette County      April 29, 2016
12   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
13   WA  35156                       Twin City Bank     October 2, 2015
14   GA  35259                        Fidelity Bank     October 2, 2015
15   CO  34112            United Fidelity Bank, fsb       July 10, 2015
16   IL  57772             Republic Bank of Chicago         May 8, 2015
17   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
18   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
19   IL  20290            United Fidelity Bank, fsb    January 23, 2015
20   FL  17557                       First NBC Bank    January 16, 2015
21   MN  34983                            BankVista   December 19, 2014
22   CA  34738    Bank of Southern California, N.A.    November 7, 2014
23   IL    916                  State Bank of Texas    October 24, 2014
24   MD   4862                          Howard Bank    October 17, 2014
25   IL  28462                 Providence Bank, LLC       July 25, 2014
26   GA  58125            Community & Southern Bank       July 18, 2014
27   OK  12483      Alva State Bank & Trust Company       June 27, 2014
28   FL  21793  Landmark Bank, National Association       June 20, 2014
29   IL  10450                  Great Southern Bank       June 20, 2014
..   ..    ...                                  ...                 ...
525  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
526  MO   1971                        Security Bank       March 7, 2008
527  MO  24660       Liberty Bank and Trust Company    January 25, 2008
528  OH  16848         The Citizens Banking Company     October 4, 2007
529  GA  32575                           ING DIRECT  September 28, 2007
530  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
531  UT   1249                        Far West Bank       June 25, 2004
532  NY  26778                     Union State Bank      March 19, 2004
533  FL  26838              Hancock Bank of Florida      March 12, 2004
534  NJ  31330                          No Acquirer   February 14, 2004
535  PA  27203                       Earthstar Bank   November 14, 2003
536  WI  11639                        The Park Bank         May 9, 2003
537  CA  27094                            Beal Bank    February 7, 2003
538  LA  16445            Sabine State Bank & Trust   December 17, 2002
539  TN   9961                          No Acquirer    November 8, 2002
540  GA  33784                          No Acquirer  September 30, 2002
541  IL  29355               Chicago Community Bank       June 27, 2002
542  CT  19183                   Hudson United Bank       June 26, 2002
543  MI  34979                          No Acquirer      March 28, 2002
544  FL  26652                       Bank Leumi USA       March 1, 2002
545  AZ  22314                          No Acquirer    February 7, 2002
546  OH   8966       The State Bank & Trust Company    February 1, 2002
547  TX  22002     The Security State Bank of Pecos    January 18, 2002
548  FL  24382     Israel Discount Bank of New York    January 11, 2002
549  AR  34248                   Delta Trust & Bank   September 7, 2001
550  IL  32646                Superior Federal, FSB       July 27, 2001
551  OH   6629                    North Valley Bank         May 3, 2001
552  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
553  IL   3815              Banterra Bank of Marion   December 14, 2000
554  HI  21029                   Bank of the Orient    October 13, 2000

           Updated Date
0      February 1, 2019
1     February 21, 2018
2      January 29, 2019
3        March 22, 2018
4      January 29, 2019
5      January 29, 2019
6      January 29, 2019
7          May 18, 2017
8      January 29, 2019
9     December 13, 2018
10    November 13, 2018
11   September 14, 2018
12     January 29, 2019
13    February 19, 2018
14         July 9, 2018
15    February 20, 2018
16     January 29, 2019
17     January 29, 2019
18     January 29, 2019
19    November 15, 2017
20    November 15, 2017
21      January 3, 2018
22    November 10, 2016
23      January 6, 2016
24     January 29, 2019
25    December 12, 2016
26      October 6, 2017
27    February 21, 2018
28     January 29, 2019
29     January 29, 2019
..                  ...
525    February 1, 2019
526    January 31, 2019
527    October 26, 2012
528  September 12, 2016
529    January 31, 2019
530    October 27, 2010
531       April 9, 2008
532       April 9, 2008
533      April 17, 2018
534       April 9, 2008
535     October 6, 2017
536        June 5, 2012
537    October 20, 2008
538    October 20, 2004
539      March 18, 2005
540  September 11, 2006
541     October 6, 2017
542   February 14, 2012
543      March 18, 2005
544       April 9, 2008
545    February 5, 2015
546    October 25, 2012
547    November 6, 2003
548  September 21, 2015
549     October 6, 2017
550     August 19, 2014
551   November 18, 2002
552   February 18, 2003
553      March 17, 2005
554      March 17, 2005

[555 rows x 7 columns]

In [47]:
whsSK=pd.read_html("https://en.wikipedia.org/wiki/List_of_World_Heritage_Sites_in_South_Korea")
whs_SK=whsSK[0] #mengambil data dari index 0 sedangkan untuk mengambil tabel kedua dalam website menggunakan index 1 dan tabel ketiga menggunakan indeks 2
print(whs_SK)

                                                 Site  Image  \
0                               Baekje Historic Areas    NaN
1            Gochang, Hwasun and Ganghwa Dolmen Sites    NaN
2                        Changdeokgung Palace Complex    NaN
3                             Gyeongju Historic Areas    NaN
4   Haeinsa Temple Janggyeong Panjeon, the Deposit...    NaN
5      Historic Villages of Korea: Hahoe and Yangdong    NaN
6                                   Hwaseong Fortress    NaN
7                 Jeju Volcanic Island and Lava Tubes    NaN
8                                      Jongmyo Shrine    NaN
9                                      Namhansanseong    NaN
10                  Royal Tombs of the Joseon Dynasty    NaN
11      Sansa, Buddhist Mountain Monasteries in Korea    NaN
12               Seokguram Grotto and Bulguksa Temple    NaN

                                             Location                Criteria  \
0   South Chungcheong and North Jeolla36°27′43″N 1...      Cultural:(ii)(iii)
1   Incheon, North Jeolla and South Jeolla34°58′00...          Cultural:(iii)
2   Seoul37°33′00″N 126°59′00″E﻿ / ﻿37.55000°N 126...  Cultural:(ii)(iii)(iv)
3   North Gyeongsang35°47′20″N 129°13′36″E﻿ / ﻿35....      Cultural:(ii)(iii)
4   South Gyeongsang35°48′00″N 128°06′00″E﻿ / ﻿35....       Cultural:(iv)(vi)
5   North Gyeongsang36°32′21″N 128°31′00″E﻿ / ﻿36....      Cultural:(iii)(iv)
6   Gyeonggi37°16′20″N 127°00′30″E﻿ / ﻿37.27222°N ...      Cultural:(ii)(iii)
7   Jeju33°28′08″N 126°43′13″E﻿ / ﻿33.46889°N 126....     Natural:(vii)(viii)
8   Seoul37°33′00″N 126°59′00″E﻿ / ﻿37.55000°N 126...           Cultural:(iv)
9   Gyeonggi37°28′44″N 127°10′52″E﻿ / ﻿37.47889°N ...       Cultural:(ii)(iv)
10  Gyeonggi and Seoul37°11′50″N 128°27′10″E﻿ / ﻿3...  Cultural:(iii)(iv)(vi)
11  North Chungcheong, North Gyeongsang, South Chu...          Cultural:(iii)
12  North Gyeongsang35°47′00″N 129°21′00″E﻿ / ﻿35....        Cultural:(i)(iv)

   Areaha (acre)  Year Description
0            NaN  2015         [9]
1              —  2000        [10]
2              —  1997        [11]
3            NaN  2000        [12]
4              —  1995        [13]
5            NaN  2010        [14]
6              —  1997        [15]
7            NaN  2007        [16]
8            NaN  1995        [17]
9            NaN  2014        [18]
10           NaN  2009        [19]
11           NaN  2018        [20]
12             —  1995        [21]